9/data/attachments/a7ee2d2bae06d4a3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Todd_affect_Friend_87738_7</nif:username>
            <nif:friendToBeRequested>soap_friends_c5b21c29-f198-4567-aa82-797cd4783e46</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>